In [10]:
import mysql.connector as sql
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [11]:
# Create SQL Connection
connection = sql.connect(
    host='localhost',
    user='felix',
    password = 'admin'
)

print(connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001FC1DA1F940>

In [12]:
cursor = connection.cursor()

cursor.execute('SHOW DATABASES')

for i in cursor:
    print(i)

('customer',)
('information_schema',)
('john',)
('mysql',)
('northwind',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [13]:
# Now we will define a function to make the use of pandas easier
def qr(query):
    df = pd.read_sql(query, con=connection)
    return df

In [14]:
qr('SHOW DATABASES')

             Database
0            customer
1  information_schema
2                john
3               mysql
4           northwind
5  performance_schema
6              sakila
7                 sys
8               world

In [15]:
cursor.execute('USE northwind')

In [16]:
qr('show tables')

     Tables_in_northwind
0             categories
1   customercustomerdemo
2   customerdemographics
3              customers
4              employees
5    employeeterritories
6           orderdetails
7                 orders
8               products
9                 region
10              shippers
11             suppliers
12           territories

In [17]:
qr('describe categories')

          Field            Type Null  Key Default           Extra
0    CategoryID          b'int'   NO  PRI    None  auto_increment
1  CategoryName  b'varchar(15)'   NO  MUL    None
2   Description   b'mediumtext'  YES         None
3       Picture     b'longblob'  YES         None

In [19]:
qr('select * from customers').head()

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,None,12209,Germany,030-0074321,030-0076545
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitucin 2222,Mxico D.F.,None,05021,Mexico,(5) 555-4729,(5) 555-3745
2,ANTON,Antonio Moreno Taquera,Antonio Moreno,Owner,Mataderos 2312,Mxico D.F.,None,05023,Mexico,(5) 555-3932,None
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,None,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,BERGS,Berglunds snabbkp,Christina Berglund,Order Administrator,Berguvsvgen 8,Lule,None,S-958 22,Sweden,0921-12 34 65,0921-12 34 67

In [37]:
df = qr('''
SELECT ProductID, ProductName
FROM products
WHERE Discontinued = 0''')